GopalSaraf/Practicals/PSDL/include/proc/pic18f27k42.inc
// Register: DMA2DPTRH
#define DMA2DPTRH DMA2DPTRH
DMA2DPTRH                                equ 03BCDh
// bitfield definitions
DMA2DPTRH_DPTR_POSN                      equ 0000h
DMA2DPTRH_DPTR_POSITION                  equ 0000h
DMA2DPTRH_DPTR_SIZE                      equ 0008h
DMA2DPTRH_DPTR_LENGTH                    equ 0008h
DMA2DPTRH_DPTR_MASK                      equ 00FFh
DMA2DPTRH_DPTR8_POSN                     equ 0000h
DMA2DPTRH_DPTR8_POSITION                 equ 0000h
DMA2DPTRH_DPTR8_SIZE                     equ 0001h
DMA2DPTRH_DPTR8_LENGTH                   equ 0001h
DMA2DPTRH_DPTR8_MASK                     equ 0001h
DMA2DPTRH_DPTR9_POSN                     equ 0001h
DMA2DPTRH_DPTR9_POSITION                 equ 0001h
DMA2DPTRH_DPTR9_SIZE                     equ 0001h
DMA2DPTRH_DPTR9_LENGTH                   equ 0001h
DMA2DPTRH_DPTR9_MASK                     equ 0002h
DMA2DPTRH_DPTR10_POSN                    equ 0002h
DMA2DPTRH_DPTR10_POSITION                equ 0002h
DMA2DPTRH_DPTR10_SIZE                    equ 0001h
DMA2DPTRH_DPTR10_LENGTH                  equ 0001h
DMA2DPTRH_DPTR10_MASK                    equ 0004h
DMA2DPTRH_DPTR11_POSN                    equ 0003h
DMA2DPTRH_DPTR11_POSITION                equ 0003h
DMA2DPTRH_DPTR11_SIZE                    equ 0001h
DMA2DPTRH_DPTR11_LENGTH                  equ 0001h
DMA2DPTRH_DPTR11_MASK                    equ 0008h
DMA2DPTRH_DPTR12_POSN                    equ 0004h
DMA2DPTRH_DPTR12_POSITION                equ 0004h
DMA2DPTRH_DPTR12_SIZE                    equ 0001h
DMA2DPTRH_DPTR12_LENGTH                  equ 0001h
DMA2DPTRH_DPTR12_MASK                    equ 0010h
DMA2DPTRH_DPTR13_POSN                    equ 0005h
DMA2DPTRH_DPTR13_POSITION                equ 0005h
DMA2DPTRH_DPTR13_SIZE                    equ 0001h
DMA2DPTRH_DPTR13_LENGTH                  equ 0001h
DMA2DPTRH_DPTR13_MASK                    equ 0020h
DMA2DPTRH_DPTR14_POSN                    equ 0006h
DMA2DPTRH_DPTR14_POSITION                equ 0006h
DMA2DPTRH_DPTR14_SIZE                    equ 0001h
DMA2DPTRH_DPTR14_LENGTH                  equ 0001h
DMA2DPTRH_DPTR14_MASK                    equ 0040h
DMA2DPTRH_DPTR15_POSN                    equ 0007h
DMA2DPTRH_DPTR15_POSITION                equ 0007h
DMA2DPTRH_DPTR15_SIZE                    equ 0001h
DMA2DPTRH_DPTR15_LENGTH                  equ 0001h
DMA2DPTRH_DPTR15_MASK                    equ 0080h
DMA2DPTRH_DMA2DPTR_POSN                  equ 0000h
DMA2DPTRH_DMA2DPTR_POSITION              equ 0000h
DMA2DPTRH_DMA2DPTR_SIZE                  equ 0008h
DMA2DPTRH_DMA2DPTR_LENGTH                equ 0008h
DMA2DPTRH_DMA2DPTR_MASK                  equ 00FFh
DMA2DPTRH_DMA2DPTR8_POSN                 equ 0000h
DMA2DPTRH_DMA2DPTR8_POSITION             equ 0000h
DMA2DPTRH_DMA2DPTR8_SIZE                 equ 0001h
DMA2DPTRH_DMA2DPTR8_LENGTH               equ 0001h
DMA2DPTRH_DMA2DPTR8_MASK                 equ 0001h
DMA2DPTRH_DMA2DPTR9_POSN                 equ 0001h
DMA2DPTRH_DMA2DPTR9_POSITION             equ 0001h
DMA2DPTRH_DMA2DPTR9_SIZE                 equ 0001h
DMA2DPTRH_DMA2DPTR9_LENGTH               equ 0001h
DMA2DPTRH_DMA2DPTR9_MASK                 equ 0002h
DMA2DPTRH_DMA2DPTR10_POSN                equ 0002h
DMA2DPTRH_DMA2DPTR10_POSITION            equ 0002h
DMA2DPTRH_DMA2DPTR10_SIZE                equ 0001h
DMA2DPTRH_DMA2DPTR10_LENGTH              equ 0001h
DMA2DPTRH_DMA2DPTR10_MASK                equ 0004h
DMA2DPTRH_DMA2DPTR11_POSN                equ 0003h
DMA2DPTRH_DMA2DPTR11_POSITION            equ 0003h
DMA2DPTRH_DMA2DPTR11_SIZE                equ 0001h
DMA2DPTRH_DMA2DPTR11_LENGTH              equ 0001h
DMA2DPTRH_DMA2DPTR11_MASK                equ 0008h
DMA2DPTRH_DMA2DPTR12_POSN                equ 0004h
DMA2DPTRH_DMA2DPTR12_POSITION            equ 0004h
DMA2DPTRH_DMA2DPTR12_SIZE                equ 0001h
DMA2DPTRH_DMA2DPTR12_LENGTH              equ 0001h
DMA2DPTRH_DMA2DPTR12_MASK                equ 0010h
DMA2DPTRH_DMA2DPTR13_POSN                equ 0005h
DMA2DPTRH_DMA2DPTR13_POSITION            equ 0005h
DMA2DPTRH_DMA2DPTR13_SIZE                equ 0001h
DMA2DPTRH_DMA2DPTR13_LENGTH              equ 0001h
DMA2DPTRH_DMA2DPTR13_MASK                equ 0020h
DMA2DPTRH_DMA2DPTR14_POSN                equ 0006h
DMA2DPTRH_DMA2DPTR14_POSITION            equ 0006h
DMA2DPTRH_DMA2DPTR14_SIZE                equ 0001h
DMA2DPTRH_DMA2DPTR14_LENGTH              equ 0001h
DMA2DPTRH_DMA2DPTR14_MASK                equ 0040h
DMA2DPTRH_DMA2DPTR15_POSN                equ 0007h
DMA2DPTRH_DMA2DPTR15_POSITION            equ 0007h
DMA2DPTRH_DMA2DPTR15_SIZE                equ 0001h
DMA2DPTRH_DMA2DPTR15_LENGTH              equ 0001h
DMA2DPTRH_DMA2DPTR15_MASK                equ 0080h

// Register: DMA2DSZ
#define DMA2DSZ DMA2DSZ
DMA2DSZ                                  equ 03BCEh

// Register: DMA2DSZL
#define DMA2DSZL DMA2DSZL
DMA2DSZL                                 equ 03BCEh
// bitfield definitions
DMA2DSZL_DSZ_POSN                        equ 0000h
DMA2DSZL_DSZ_POSITION                    equ 0000h
DMA2DSZL_DSZ_SIZE                        equ 0008h
DMA2DSZL_DSZ_LENGTH                      equ 0008h
DMA2DSZL_DSZ_MASK                        equ 00FFh
DMA2DSZL_DMA2DSZ_POSN                    equ 0000h
DMA2DSZL_DMA2DSZ_POSITION                equ 0000h
DMA2DSZL_DMA2DSZ_SIZE                    equ 0008h
DMA2DSZL_DMA2DSZ_LENGTH                  equ 0008h
DMA2DSZL_DMA2DSZ_MASK                    equ 00FFh
DMA2DSZL_DSZ0_POSN                       equ 0000h
DMA2DSZL_DSZ0_POSITION                   equ 0000h
DMA2DSZL_DSZ0_SIZE                       equ 0001h
DMA2DSZL_DSZ0_LENGTH                     equ 0001h
DMA2DSZL_DSZ0_MASK                       equ 0001h
DMA2DSZL_DSZ1_POSN                       equ 0001h
DMA2DSZL_DSZ1_POSITION                   equ 0001h
DMA2DSZL_DSZ1_SIZE                       equ 0001h
DMA2DSZL_DSZ1_LENGTH                     equ 0001h
DMA2DSZL_DSZ1_MASK                       equ 0002h
DMA2DSZL_DSZ2_POSN                       equ 0002h
DMA2DSZL_DSZ2_POSITION                   equ 0002h
DMA2DSZL_DSZ2_SIZE                       equ 0001h
DMA2DSZL_DSZ2_LENGTH                     equ 0001h
DMA2DSZL_DSZ2_MASK                       equ 0004h
DMA2DSZL_DSZ3_POSN                       equ 0003h
DMA2DSZL_DSZ3_POSITION                   equ 0003h
DMA2DSZL_DSZ3_SIZE                       equ 0001h
DMA2DSZL_DSZ3_LENGTH                     equ 0001h
DMA2DSZL_DSZ3_MASK                       equ 0008h
DMA2DSZL_DSZ4_POSN                       equ 0004h
DMA2DSZL_DSZ4_POSITION                   equ 0004h
DMA2DSZL_DSZ4_SIZE                       equ 0001h
DMA2DSZL_DSZ4_LENGTH                     equ 0001h
DMA2DSZL_DSZ4_MASK                       equ 0010h
DMA2DSZL_DSZ5_POSN                       equ 0005h
DMA2DSZL_DSZ5_POSITION                   equ 0005h
DMA2DSZL_DSZ5_SIZE                       equ 0001h
DMA2DSZL_DSZ5_LENGTH                     equ 0001h
DMA2DSZL_DSZ5_MASK                       equ 0020h
DMA2DSZL_DSZ6_POSN                       equ 0006h
DMA2DSZL_DSZ6_POSITION                   equ 0006h
DMA2DSZL_DSZ6_SIZE                       equ 0001h
DMA2DSZL_DSZ6_LENGTH                     equ 0001h
DMA2DSZL_DSZ6_MASK                       equ 0040h
DMA2DSZL_DSZ7_POSN                       equ 0007h
DMA2DSZL_DSZ7_POSITION                   equ 0007h
DMA2DSZL_DSZ7_SIZE                       equ 0001h
DMA2DSZL_DSZ7_LENGTH                     equ 0001h
DMA2DSZL_DSZ7_MASK                       equ 0080h
DMA2DSZL_DMA2DSZ0_POSN                   equ 0000h
DMA2DSZL_DMA2DSZ0_POSITION               equ 0000h
DMA2DSZL_DMA2DSZ0_SIZE                   equ 0001h
DMA2DSZL_DMA2DSZ0_LENGTH                 equ 0001h
DMA2DSZL_DMA2DSZ0_MASK                   equ 0001h
DMA2DSZL_DMA2DSZ1_POSN                   equ 0001h
DMA2DSZL_DMA2DSZ1_POSITION               equ 0001h
DMA2DSZL_DMA2DSZ1_SIZE                   equ 0001h
DMA2DSZL_DMA2DSZ1_LENGTH                 equ 0001h
DMA2DSZL_DMA2DSZ1_MASK                   equ 0002h
DMA2DSZL_DMA2DSZ2_POSN                   equ 0002h
DMA2DSZL_DMA2DSZ2_POSITION               equ 0002h
DMA2DSZL_DMA2DSZ2_SIZE                   equ 0001h
DMA2DSZL_DMA2DSZ2_LENGTH                 equ 0001h
DMA2DSZL_DMA2DSZ2_MASK                   equ 0004h
DMA2DSZL_DMA2DSZ3_POSN                   equ 0003h
DMA2DSZL_DMA2DSZ3_POSITION               equ 0003h
DMA2DSZL_DMA2DSZ3_SIZE                   equ 0001h
DMA2DSZL_DMA2DSZ3_LENGTH                 equ 0001h
DMA2DSZL_DMA2DSZ3_MASK                   equ 0008h
DMA2DSZL_DMA2DSZ4_POSN                   equ 0004h
DMA2DSZL_DMA2DSZ4_POSITION               equ 0004h
DMA2DSZL_DMA2DSZ4_SIZE                   equ 0001h
DMA2DSZL_DMA2DSZ4_LENGTH                 equ 0001h
DMA2DSZL_DMA2DSZ4_MASK                   equ 0010h
DMA2DSZL_DMA2DSZ5_POSN                   equ 0005h
DMA2DSZL_DMA2DSZ5_POSITION               equ 0005h
DMA2DSZL_DMA2DSZ5_SIZE                   equ 0001h
DMA2DSZL_DMA2DSZ5_LENGTH                 equ 0001h
DMA2DSZL_DMA2DSZ5_MASK                   equ 0020h
DMA2DSZL_DMA2DSZ6_POSN                   equ 0006h
DMA2DSZL_DMA2DSZ6_POSITION               equ 0006h
DMA2DSZL_DMA2DSZ6_SIZE                   equ 0001h
DMA2DSZL_DMA2DSZ6_LENGTH                 equ 0001h
DMA2DSZL_DMA2DSZ6_MASK                   equ 0040h
DMA2DSZL_DMA2DSZ7_POSN                   equ 0007h
DMA2DSZL_DMA2DSZ7_POSITION               equ 0007h
DMA2DSZL_DMA2DSZ7_SIZE                   equ 0001h
DMA2DSZL_DMA2DSZ7_LENGTH                 equ 0001h
DMA2DSZL_DMA2DSZ7_MASK                   equ 0080h

// Register: DMA2DSZH
#define DMA2DSZH DMA2DSZH
DMA2DSZH                                 equ 03BCFh
// bitfield definitions
DMA2DSZH_DSZ_POSN                        equ 0000h
DMA2DSZH_DSZ_POSITION                    equ 0000h
DMA2DSZH_DSZ_SIZE                        equ 0004h
DMA2DSZH_DSZ_LENGTH                      equ 0004h
DMA2DSZH_DSZ_MASK                        equ 000Fh
DMA2DSZH_DMA2DSZ_POSN                    equ 0000h
DMA2DSZH_DMA2DSZ_POSITION                equ 0000h
DMA2DSZH_DMA2DSZ_SIZE                    equ 0004h
DMA2DSZH_DMA2DSZ_LENGTH                  equ 0004h
DMA2DSZH_DMA2DSZ_MASK                    equ 000Fh
DMA2DSZH_DSZ8_POSN                       equ 0000h
DMA2DSZH_DSZ8_POSITION                   equ 0000h
DMA2DSZH_DSZ8_SIZE                       equ 0001h
DMA2DSZH_DSZ8_LENGTH                     equ 0001h
DMA2DSZH_DSZ8_MASK                       equ 0001h
DMA2DSZH_DSZ9_POSN                       equ 0001h
DMA2DSZH_DSZ9_POSITION                   equ 0001h
DMA2DSZH_DSZ9_SIZE                       equ 0001h
DMA2DSZH_DSZ9_LENGTH                     equ 0001h
DMA2DSZH_DSZ9_MASK                       equ 0002h
DMA2DSZH_DSZ10_POSN                      equ 0002h
DMA2DSZH_DSZ10_POSITION                  equ 0002h
DMA2DSZH_DSZ10_SIZE                      equ 0001h
DMA2DSZH_DSZ10_LENGTH                    equ 0001h
DMA2DSZH_DSZ10_MASK                      equ 0004h
DMA2DSZH_DSZ11_POSN                      equ 0003h
DMA2DSZH_DSZ11_POSITION                  equ 0003h
DMA2DSZH_DSZ11_SIZE                      equ 0001h
DMA2DSZH_DSZ11_LENGTH                    equ 0001h
DMA2DSZH_DSZ11_MASK                      equ 0008h
DMA2DSZH_DMA2DSZ8_POSN                   equ 0000h
DMA2DSZH_DMA2DSZ8_POSITION               equ 0000h
DMA2DSZH_DMA2DSZ8_SIZE                   equ 0001h
DMA2DSZH_DMA2DSZ8_LENGTH                 equ 0001h
DMA2DSZH_DMA2DSZ8_MASK                   equ 0001h
DMA2DSZH_DMA2DSZ9_POSN                   equ 0001h
DMA2DSZH_DMA2DSZ9_POSITION               equ 0001h
DMA2DSZH_DMA2DSZ9_SIZE                   equ 0001h
DMA2DSZH_DMA2DSZ9_LENGTH                 equ 0001h
DMA2DSZH_DMA2DSZ9_MASK                   equ 0002h
DMA2DSZH_DMA2DSZ10_POSN                  equ 0002h
DMA2DSZH_DMA2DSZ10_POSITION              equ 0002h
DMA2DSZH_DMA2DSZ10_SIZE                  equ 0001h
DMA2DSZH_DMA2DSZ10_LENGTH                equ 0001h
DMA2DSZH_DMA2DSZ10_MASK                  equ 0004h
DMA2DSZH_DMA2DSZ11_POSN                  equ 0003h
DMA2DSZH_DMA2DSZ11_POSITION              equ 0003h
DMA2DSZH_DMA2DSZ11_SIZE                  equ 0001h
DMA2DSZH_DMA2DSZ11_LENGTH                equ 0001h
DMA2DSZH_DMA2DSZ11_MASK                  equ 0008h

