GopalSaraf/Practicals/PSDL/include/proc/pic18f27k42.inc
// Register: CLC2GLS0
#define CLC2GLS0 CLC2GLS0
CLC2GLS0                                 equ 03C70h
// bitfield definitions
CLC2GLS0_G1D1N_POSN                      equ 0000h
CLC2GLS0_G1D1N_POSITION                  equ 0000h
CLC2GLS0_G1D1N_SIZE                      equ 0001h
CLC2GLS0_G1D1N_LENGTH                    equ 0001h
CLC2GLS0_G1D1N_MASK                      equ 0001h
CLC2GLS0_G1D1T_POSN                      equ 0001h
CLC2GLS0_G1D1T_POSITION                  equ 0001h
CLC2GLS0_G1D1T_SIZE                      equ 0001h
CLC2GLS0_G1D1T_LENGTH                    equ 0001h
CLC2GLS0_G1D1T_MASK                      equ 0002h
CLC2GLS0_G1D2N_POSN                      equ 0002h
CLC2GLS0_G1D2N_POSITION                  equ 0002h
CLC2GLS0_G1D2N_SIZE                      equ 0001h
CLC2GLS0_G1D2N_LENGTH                    equ 0001h
CLC2GLS0_G1D2N_MASK                      equ 0004h
CLC2GLS0_G1D2T_POSN                      equ 0003h
CLC2GLS0_G1D2T_POSITION                  equ 0003h
CLC2GLS0_G1D2T_SIZE                      equ 0001h
CLC2GLS0_G1D2T_LENGTH                    equ 0001h
CLC2GLS0_G1D2T_MASK                      equ 0008h
CLC2GLS0_G1D3N_POSN                      equ 0004h
CLC2GLS0_G1D3N_POSITION                  equ 0004h
CLC2GLS0_G1D3N_SIZE                      equ 0001h
CLC2GLS0_G1D3N_LENGTH                    equ 0001h
CLC2GLS0_G1D3N_MASK                      equ 0010h
CLC2GLS0_G1D3T_POSN                      equ 0005h
CLC2GLS0_G1D3T_POSITION                  equ 0005h
CLC2GLS0_G1D3T_SIZE                      equ 0001h
CLC2GLS0_G1D3T_LENGTH                    equ 0001h
CLC2GLS0_G1D3T_MASK                      equ 0020h
CLC2GLS0_G1D4N_POSN                      equ 0006h
CLC2GLS0_G1D4N_POSITION                  equ 0006h
CLC2GLS0_G1D4N_SIZE                      equ 0001h
CLC2GLS0_G1D4N_LENGTH                    equ 0001h
CLC2GLS0_G1D4N_MASK                      equ 0040h
CLC2GLS0_G1D4T_POSN                      equ 0007h
CLC2GLS0_G1D4T_POSITION                  equ 0007h
CLC2GLS0_G1D4T_SIZE                      equ 0001h
CLC2GLS0_G1D4T_LENGTH                    equ 0001h
CLC2GLS0_G1D4T_MASK                      equ 0080h
CLC2GLS0_LC2G1D1N_POSN                   equ 0000h
CLC2GLS0_LC2G1D1N_POSITION               equ 0000h
CLC2GLS0_LC2G1D1N_SIZE                   equ 0001h
CLC2GLS0_LC2G1D1N_LENGTH                 equ 0001h
CLC2GLS0_LC2G1D1N_MASK                   equ 0001h
CLC2GLS0_LC2G1D1T_POSN                   equ 0001h
CLC2GLS0_LC2G1D1T_POSITION               equ 0001h
CLC2GLS0_LC2G1D1T_SIZE                   equ 0001h
CLC2GLS0_LC2G1D1T_LENGTH                 equ 0001h
CLC2GLS0_LC2G1D1T_MASK                   equ 0002h
CLC2GLS0_LC2G1D2N_POSN                   equ 0002h
CLC2GLS0_LC2G1D2N_POSITION               equ 0002h
CLC2GLS0_LC2G1D2N_SIZE                   equ 0001h
CLC2GLS0_LC2G1D2N_LENGTH                 equ 0001h
CLC2GLS0_LC2G1D2N_MASK                   equ 0004h
CLC2GLS0_LC2G1D2T_POSN                   equ 0003h
CLC2GLS0_LC2G1D2T_POSITION               equ 0003h
CLC2GLS0_LC2G1D2T_SIZE                   equ 0001h
CLC2GLS0_LC2G1D2T_LENGTH                 equ 0001h
CLC2GLS0_LC2G1D2T_MASK                   equ 0008h
CLC2GLS0_LC2G1D3N_POSN                   equ 0004h
CLC2GLS0_LC2G1D3N_POSITION               equ 0004h
CLC2GLS0_LC2G1D3N_SIZE                   equ 0001h
CLC2GLS0_LC2G1D3N_LENGTH                 equ 0001h
CLC2GLS0_LC2G1D3N_MASK                   equ 0010h
CLC2GLS0_LC2G1D3T_POSN                   equ 0005h
CLC2GLS0_LC2G1D3T_POSITION               equ 0005h
CLC2GLS0_LC2G1D3T_SIZE                   equ 0001h
CLC2GLS0_LC2G1D3T_LENGTH                 equ 0001h
CLC2GLS0_LC2G1D3T_MASK                   equ 0020h
CLC2GLS0_LC2G1D4N_POSN                   equ 0006h
CLC2GLS0_LC2G1D4N_POSITION               equ 0006h
CLC2GLS0_LC2G1D4N_SIZE                   equ 0001h
CLC2GLS0_LC2G1D4N_LENGTH                 equ 0001h
CLC2GLS0_LC2G1D4N_MASK                   equ 0040h
CLC2GLS0_LC2G1D4T_POSN                   equ 0007h
CLC2GLS0_LC2G1D4T_POSITION               equ 0007h
CLC2GLS0_LC2G1D4T_SIZE                   equ 0001h
CLC2GLS0_LC2G1D4T_LENGTH                 equ 0001h
CLC2GLS0_LC2G1D4T_MASK                   equ 0080h

// Register: CLC2GLS1
#define CLC2GLS1 CLC2GLS1
CLC2GLS1                                 equ 03C71h
// bitfield definitions
CLC2GLS1_G2D1N_POSN                      equ 0000h
CLC2GLS1_G2D1N_POSITION                  equ 0000h
CLC2GLS1_G2D1N_SIZE                      equ 0001h
CLC2GLS1_G2D1N_LENGTH                    equ 0001h
CLC2GLS1_G2D1N_MASK                      equ 0001h
CLC2GLS1_G2D1T_POSN                      equ 0001h
CLC2GLS1_G2D1T_POSITION                  equ 0001h
CLC2GLS1_G2D1T_SIZE                      equ 0001h
CLC2GLS1_G2D1T_LENGTH                    equ 0001h
CLC2GLS1_G2D1T_MASK                      equ 0002h
CLC2GLS1_G2D2N_POSN                      equ 0002h
CLC2GLS1_G2D2N_POSITION                  equ 0002h
CLC2GLS1_G2D2N_SIZE                      equ 0001h
CLC2GLS1_G2D2N_LENGTH                    equ 0001h
CLC2GLS1_G2D2N_MASK                      equ 0004h
CLC2GLS1_G2D2T_POSN                      equ 0003h
CLC2GLS1_G2D2T_POSITION                  equ 0003h
CLC2GLS1_G2D2T_SIZE                      equ 0001h
CLC2GLS1_G2D2T_LENGTH                    equ 0001h
CLC2GLS1_G2D2T_MASK                      equ 0008h
CLC2GLS1_G2D3N_POSN                      equ 0004h
CLC2GLS1_G2D3N_POSITION                  equ 0004h
CLC2GLS1_G2D3N_SIZE                      equ 0001h
CLC2GLS1_G2D3N_LENGTH                    equ 0001h
CLC2GLS1_G2D3N_MASK                      equ 0010h
CLC2GLS1_G2D3T_POSN                      equ 0005h
CLC2GLS1_G2D3T_POSITION                  equ 0005h
CLC2GLS1_G2D3T_SIZE                      equ 0001h
CLC2GLS1_G2D3T_LENGTH                    equ 0001h
CLC2GLS1_G2D3T_MASK                      equ 0020h
CLC2GLS1_G2D4N_POSN                      equ 0006h
CLC2GLS1_G2D4N_POSITION                  equ 0006h
CLC2GLS1_G2D4N_SIZE                      equ 0001h
CLC2GLS1_G2D4N_LENGTH                    equ 0001h
CLC2GLS1_G2D4N_MASK                      equ 0040h
CLC2GLS1_G2D4T_POSN                      equ 0007h
CLC2GLS1_G2D4T_POSITION                  equ 0007h
CLC2GLS1_G2D4T_SIZE                      equ 0001h
CLC2GLS1_G2D4T_LENGTH                    equ 0001h
CLC2GLS1_G2D4T_MASK                      equ 0080h
CLC2GLS1_LC2G2D1N_POSN                   equ 0000h
CLC2GLS1_LC2G2D1N_POSITION               equ 0000h
CLC2GLS1_LC2G2D1N_SIZE                   equ 0001h
CLC2GLS1_LC2G2D1N_LENGTH                 equ 0001h
CLC2GLS1_LC2G2D1N_MASK                   equ 0001h
CLC2GLS1_LC2G2D1T_POSN                   equ 0001h
CLC2GLS1_LC2G2D1T_POSITION               equ 0001h
CLC2GLS1_LC2G2D1T_SIZE                   equ 0001h
CLC2GLS1_LC2G2D1T_LENGTH                 equ 0001h
CLC2GLS1_LC2G2D1T_MASK                   equ 0002h
CLC2GLS1_LC2G2D2N_POSN                   equ 0002h
CLC2GLS1_LC2G2D2N_POSITION               equ 0002h
CLC2GLS1_LC2G2D2N_SIZE                   equ 0001h
CLC2GLS1_LC2G2D2N_LENGTH                 equ 0001h
CLC2GLS1_LC2G2D2N_MASK                   equ 0004h
CLC2GLS1_LC2G2D2T_POSN                   equ 0003h
CLC2GLS1_LC2G2D2T_POSITION               equ 0003h
CLC2GLS1_LC2G2D2T_SIZE                   equ 0001h
CLC2GLS1_LC2G2D2T_LENGTH                 equ 0001h
CLC2GLS1_LC2G2D2T_MASK                   equ 0008h
CLC2GLS1_LC2G2D3N_POSN                   equ 0004h
CLC2GLS1_LC2G2D3N_POSITION               equ 0004h
CLC2GLS1_LC2G2D3N_SIZE                   equ 0001h
CLC2GLS1_LC2G2D3N_LENGTH                 equ 0001h
CLC2GLS1_LC2G2D3N_MASK                   equ 0010h
CLC2GLS1_LC2G2D3T_POSN                   equ 0005h
CLC2GLS1_LC2G2D3T_POSITION               equ 0005h
CLC2GLS1_LC2G2D3T_SIZE                   equ 0001h
CLC2GLS1_LC2G2D3T_LENGTH                 equ 0001h
CLC2GLS1_LC2G2D3T_MASK                   equ 0020h
CLC2GLS1_LC2G2D4N_POSN                   equ 0006h
CLC2GLS1_LC2G2D4N_POSITION               equ 0006h
CLC2GLS1_LC2G2D4N_SIZE                   equ 0001h
CLC2GLS1_LC2G2D4N_LENGTH                 equ 0001h
CLC2GLS1_LC2G2D4N_MASK                   equ 0040h
CLC2GLS1_LC2G2D4T_POSN                   equ 0007h
CLC2GLS1_LC2G2D4T_POSITION               equ 0007h
CLC2GLS1_LC2G2D4T_SIZE                   equ 0001h
CLC2GLS1_LC2G2D4T_LENGTH                 equ 0001h
CLC2GLS1_LC2G2D4T_MASK                   equ 0080h

